In [1]:
import pandas as pd
import numpy as np

In [4]:
name=pd.Series(['One','two','three','Four'])
name

0      One
1      two
2    three
3     Four
dtype: object

In [9]:
name.replace(['One','three'],['Hi','hello'],inplace=True)

In [10]:
name

0       Hi
1      two
2    hello
3     Four
dtype: object

In [13]:
name.replace({'two':'THree'},inplace=True)

In [14]:
name

0       Hi
1    THree
2    hello
3     Four
dtype: object

In [15]:
data = pd.DataFrame(np.arange(0,16).reshape(4,4),columns=['A','B','C','D'])

In [16]:
data

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
data.replace([1,10,13],[100,1000,130],inplace=True)

In [19]:
data

    A    B     C   D
0   0  100     2   3
1   4    5     6   7
2   8    9  1000  11
3  12  130    14  15

In [20]:
data=pd.DataFrame(np.arange(0,9).reshape(3,3),columns=['NY','LA','SP'],index=['A','B','C'])
data

   NY  LA  SP
A   0   1   2
B   3   4   5
C   6   7   8

In [27]:
data.rename({'A':'Apple'},inplace=True)
data                                        #only rows that time.

       New York  los Angelies  SP
Apple         0             1   2
BEETA         3             4   5
C             6             7   8

In [23]:
data.rename({'B':'BEETA'},columns={'NY':'New York','LA':'los Angelies'},inplace =True)  #rows and colulmns both together.

In [24]:
data

       New York  los Angelies  SP
A             0             1   2
BEETA         3             4   5
C             6             7   8

rename = columns ,index

replace = values inner.

### Multiindex and heirarchical

In [39]:
ser = pd.Series(range(0,5),index =[[1,1,2,2,3],['A','B','A','C','B']])
#1 is parent and A and B is child
ser

1  A    0
   B    1
2  A    2
   C    3
3  B    4
dtype: int64

In [43]:
ser[1]

A    0
B    1
dtype: int64

In [44]:
ser[3,'B']

4

In [45]:
ser[1,'A']

0

In [58]:
ser[:,'B']

1    1
3    4
dtype: int64

In [84]:
ser = pd.Series(['A','A','B','B','B','D','D','E'],index=[['a','a','b','b','b','d','d','e'],[1,2,1,2,3,4,5,6]])

In [85]:
ser

a  1    A
   2    A
b  1    B
   2    B
   3    B
d  4    D
   5    D
e  6    E
dtype: object

In [87]:
ser['d']

4    D
5    D
dtype: object

In [89]:
ser['e']

6    E
dtype: object

In [88]:
ser['a':'b']

a  1    A
   2    A
b  1    B
   2    B
   3    B
dtype: object

In [90]:
import numpy as np
import pandas as pd
data = pd.DataFrame(np.arange(0,25,1).reshape(5,5),index=[[1,1,2,2,2],['A','Z','D','E','F']],columns=[['Delhi','Delhi','Pune','Pune','banglore'],['cold','hot','cold','rainy','pleasent']])

In [91]:
data

    Delhi     Pune       banglore
     cold hot cold rainy pleasent
1 A     0   1    2     3        4
  Z     5   6    7     8        9
2 D    10  11   12    13       14
  E    15  16   17    18       19
  F    20  21   22    23       24

iloc function is use for returns a complete row with it's parents and child.

In [92]:
data.iloc[2]

Delhi     cold        10
          hot         11
Pune      cold        12
          rainy       13
banglore  pleasent    14
Name: (2, D), dtype: int32

In [93]:
data[2:]

    Delhi     Pune       banglore
     cold hot cold rainy pleasent
2 D    10  11   12    13       14
  E    15  16   17    18       19
  F    20  21   22    23       24

In [94]:
data.iloc[4]

Delhi     cold        20
          hot         21
Pune      cold        22
          rainy       23
banglore  pleasent    24
Name: (2, F), dtype: int32

In [95]:
#loc[(row('parent','child'),(column(parent))]

In [96]:
data.loc[(2,'D'),('Pune')]

cold     12
rainy    13
Name: (2, D), dtype: int32

In [97]:
data.iloc[:,0]

1  A     0
   Z     5
2  D    10
   E    15
   F    20
Name: (Delhi, cold), dtype: int32

In [98]:
data.iloc

In [99]:
data.loc[(2,'E'),('Pune','rainy')]

18

In [100]:
data.iloc[:,2]  #specific location.

1  A     2
   Z     7
2  D    12
   E    17
   F    22
Name: (Pune, cold), dtype: int32

In [101]:
data.swaplevel(0) #it converts child into parents for rows.

    Delhi     Pune       banglore
     cold hot cold rainy pleasent
A 1     0   1    2     3        4
Z 1     5   6    7     8        9
D 2    10  11   12    13       14
E 2    15  16   17    18       19
F 2    20  21   22    23       24

In [102]:
data.swaplevel(0,axis=1) #for the columns

     cold   hot cold rainy pleasent
    Delhi Delhi Pune  Pune banglore
1 A     0     1    2     3        4
  Z     5     6    7     8        9
2 D    10    11   12    13       14
  E    15    16   17    18       19
  F    20    21   22    23       24

In [103]:
data.loc[0:1,:]

    Delhi     Pune       banglore
     cold hot cold rainy pleasent
1 A     0   1    2     3        4
  Z     5   6    7     8        9

In [104]:
data[0:2]

    Delhi     Pune       banglore
     cold hot cold rainy pleasent
1 A     0   1    2     3        4
  Z     5   6    7     8        9

#### Sorting on the basis on parent child.

For sorting,we have to take pass attribute that is level and axis.

axis=0 when we want to perform row wise operation.

x =1 when we want to perform columns wise opertaion 

level = 0 when we want operate parent wise.

level =1 when we want to operate child wise.

In [105]:
dataframe = pd.DataFrame(np.arange(0,25).reshape(5,5),index=[[1,1,2,2,3],[1,2,1,2,1]],columns=[[1,1,1,2,2],[1,2,3,1,2]])

In [106]:
dataframe

      1           2
      1   2   3   1   2
1 1   0   1   2   3   4
  2   5   6   7   8   9
2 1  10  11  12  13  14
  2  15  16  17  18  19
3 1  20  21  22  23  24

In [107]:
dataframe.sort_index(level=0,axis=0)

      1           2
      1   2   3   1   2
1 1   0   1   2   3   4
  2   5   6   7   8   9
2 1  10  11  12  13  14
  2  15  16  17  18  19
3 1  20  21  22  23  24

In [108]:
dataframe.sort_index(level=1,axis=0)

      1           2
      1   2   3   1   2
1 1   0   1   2   3   4
2 1  10  11  12  13  14
3 1  20  21  22  23  24
1 2   5   6   7   8   9
2 2  15  16  17  18  19

In [109]:
dataframe.sort_index(level=1,axis=1)  #columns wise and level=1 #columns change it's values

      1   2   1   2   1
      1   1   2   2   3
1 1   0   3   1   4   2
  2   5   8   6   9   7
2 1  10  13  11  14  12
  2  15  18  16  19  17
3 1  20  23  21  24  22

#### Merging dataframe.

In [110]:
Data =pd.DataFrame({'Key':['x','z','y','z','x','x'],'Datasets':[0,1,2,3,4,5]})

In [111]:
Data

  Key  Datasets
0   x         0
1   z         1
2   y         2
3   z         3
4   x         4
5   x         5

In [112]:
data=pd.DataFrame({'Key':['q','y','z'],'Datasets1':[1,2,3]})

In [113]:
data

  Key  Datasets1
0   q          1
1   y          2
2   z          3

In [114]:
pd.merge(Data,data)  #columns should be common.

  Key  Datasets  Datasets1
0   z         1          3
1   z         3          3
2   y         2          2

In [115]:
pd.merge(Data,data,on='Key') #on keyword is use selecting the columns merging

  Key  Datasets  Datasets1
0   z         1          3
1   z         3          3
2   y         2          2

In [116]:
pd.merge(Data,data,how='left')  #here the reference columns for merging will be use by left columns wise.

  Key  Datasets  Datasets1
0   x         0        NaN
1   z         1        3.0
2   y         2        2.0
3   z         3        3.0
4   x         4        NaN
5   x         5        NaN

In [117]:
pd.merge(Data,data,how='right')#here the reference columns for merging will be use by right columns wise.

  Key  Datasets  Datasets1
0   z       1.0          3
1   z       3.0          3
2   y       2.0          2
3   q       NaN          1

In [118]:
pd.merge(Data,data,how='outer')#here outer will be use for left and right columns wise.

  Key  Datasets  Datasets1
0   x       0.0        NaN
1   x       4.0        NaN
2   x       5.0        NaN
3   z       1.0        3.0
4   z       3.0        3.0
5   y       2.0        2.0
6   q       NaN        1.0

In [119]:
d3 = pd.DataFrame({'Dataset3':range(0,5),'key':['y','y','x','x','z']})

In [120]:
d3

   Dataset3 key
0         0   y
1         1   y
2         2   x
3         3   x
4         4   z

In [121]:
d4 = pd.DataFrame({'Dataset2':range(6),'key':['x','x','x','y','q','q']})

In [122]:
d4

   Dataset2 key
0         0   x
1         1   x
2         2   x
3         3   y
4         4   q
5         5   q

In [123]:
pd.merge(d3,d4)

   Dataset3 key  Dataset2
0         0   y         3
1         1   y         3
2         2   x         0
3         2   x         1
4         2   x         2
5         3   x         0
6         3   x         1
7         3   x         2

In [124]:
pd.merge(d3,d4,how='left')

   Dataset3 key  Dataset2
0         0   y       3.0
1         1   y       3.0
2         2   x       0.0
3         2   x       1.0
4         2   x       2.0
5         3   x       0.0
6         3   x       1.0
7         3   x       2.0
8         4   z       NaN

In [125]:
pd.merge(d3,d4,how='right')

   Dataset3 key  Dataset2
0       0.0   y         3
1       1.0   y         3
2       2.0   x         0
3       3.0   x         0
4       2.0   x         1
5       3.0   x         1
6       2.0   x         2
7       3.0   x         2
8       NaN   q         4
9       NaN   q         5

In [126]:
pd.merge(d3,d4,how='outer')

    Dataset3 key  Dataset2
0        0.0   y       3.0
1        1.0   y       3.0
2        2.0   x       0.0
3        2.0   x       1.0
4        2.0   x       2.0
5        3.0   x       0.0
6        3.0   x       1.0
7        3.0   x       2.0
8        4.0   z       NaN
9        NaN   q       4.0
10       NaN   q       5.0

In [127]:
df_left = pd.DataFrame({'key':['x','x','y','y','z'],'data':range(5)})

In [130]:
df_right = pd.DataFrame({'group_data':[10,20]},index=['x','x'])

In [131]:
df_left

  key  data
0   x     0
1   x     1
2   y     2
3   y     3
4   z     4

In [132]:
df_right

   group_data
x          10
x          20

In [133]:
pd.merge(df_left,df_right,left_on='key',right_index=True,how='outer')  #when no columns common

  key  data  group_data
0   x     0        10.0
0   x     0        20.0
1   x     1        10.0
1   x     1        20.0
2   y     2         NaN
3   y     3         NaN
4   z     4         NaN

In [135]:
data=pd.merge(df_left,df_right,left_on='key',right_index=True,how='right') 
data

  key  data  group_data
0   x     0          10
1   x     1          10
0   x     0          20
1   x     1          20

In [ ]:
data.nunique()